Repository: IntPlanet/SemiAutomaticClassificationManual_v3
Catalog: locale/*/LC_MESSAGES/scatter_plot.po
Languages: uk_ua

source: Scatter Plot
uk_ua: Діаграма розсіювання (Scatter Plot)

source: The ``Scatter plot`` window allows for the calculation of the ROI scatter plots, which are useful to assess ROI separability choosing between two bands. Pixel values for two raster bands are represented as points in the 2D space.
uk_ua: Вікно ``Scatter plot``відповідає за розрахунок діаграм розсіювання ROI, які корисні для оцінки відокремності ROI при виборі між двома каналами. Значення пікселів для двох растрів каналів відображаються як точки в двовимірному просторі.

source: :guilabel:`Scatter Plot`
uk_ua: :guilabel:`Діаграма розсіювання`

source: ROI List
uk_ua: Перелік ROI (ROI List)

source: Table fields:
uk_ua: Поля таблиці:

source: ``S`` : checkbox field;
uk_ua: ``S`` : перемикач;

source: ``MC ID`` : Macroclass ID;
uk_ua: ``MC ID`` : унікальний ідентифікатор макрокласу;

source: ``MC Info`` : Macroclass Information;
uk_ua: ``MC Info`` : характеристика макрокласу;

source: ``C ID`` : Class ID;
uk_ua: ``Class ID`` : унікальний ідентифікатор класу;

source: ``C Info`` : Class Information;
uk_ua: ``C Info`` : характеристика класу;

source: ``Color`` : color field; double click to select a color for the plot;
uk_ua: ``Color`` : колір; двічі клацніть для вибору кольору діаграми;

source: < ``Band X`` >: X band of the plot;
uk_ua: < ``Band X`` >: канал X діаграми;

source: < ``Band Y`` >: Y band of the plot;
uk_ua: < ``Band Y`` >: канал Y діаграми;

source: [ ``Calculate scatter plot`` ]: calculate the scatter plot for the ROI checked in the list (it can be time consuming).
uk_ua: [ ``Calculate scatter plot`` ]: розрахувати діаграму розсіювання значень для ROI, увімкнених в переліку (процес може бути часовитратним).

source: Plot commands (from Matplotlib):
uk_ua: Управління діаграмою (з Matplotlib):

source: |m_home|: Reset to original view;
uk_ua: |m_home|: повернутись до початкового огляду;

source: |m_back|: Back to previous view;
uk_ua: |m_back|: повернутись до попереднього огляду;

source: |m_forward|: Forward to next view;
uk_ua: |m_forward|: перейти до наступного огляду;

source: |m_pan|: Pan axes with left mouse, zoom with right;
uk_ua: |m_pan|: вибір ділянки вісей для відображення лівою кнопкою миші, зміна масштабу - правою;

source: |m_zoom|: Zoom to rectangle;
uk_ua: |m_zoom|: збільшити до прямокутника;

source: |m_sub|: Unused;
uk_ua: |m_sub|: невикористовувана команда;

source: |m_save|: Save plot to a figure (e.g. JPG file);
uk_ua: |m_save|: зберегти діаграму до рисунку (файл JPG);

source: **Tip**: it is possible to move the legend with the mouse.
uk_ua: **Порада**: легенду можна посунути мишкою.
