Repository: IntPlanet/SemiAutomaticClassificationManual_v3
Catalog: locale/*/LC_MESSAGES/spectral_signature_plot.po
Languages: uk_ua

source: Spectral Signature Plot
uk_ua: Графік спектральних сигнатур (Spectral Signature Plot)

source: The ``Spectral Signature Plot`` window allows for the displaying of spectral signature plots, which are the signature values (usually reflectance) as a function of wavelength. Signatures can be added to the ``Spectral Signature Plot`` through the :ref:`roi_dock` and the :ref:`classification_dock`.
uk_ua: Вікно ``Spectral Signature Plot`` відповідає за унаочнення графіків спектральних сигнатур, які представляють значенн сигнатур (зазвичай відбивальність) як функцію двжини хвилі. Сигнатури додаються до ``Spectral Signature Plot`` за допомогою :ref:`roi_dock` and the :ref:`classification_dock`.

source: :guilabel:`Spectral Signature Plot`
uk_ua: :guilabel:`Графік спектральних сигнатур`

source: Signature list
uk_ua: Перелік сигнатур (Signature list)

source: Table fields:
uk_ua: Поля таблиці:

source: ``S`` : checkbox field; if checked, then signature is displayed in the plot;
uk_ua: ``S`` : перемикач; якщо опцію увімкнено, то сигнатура унаочнюється на графіку;

source: ``MC ID`` : Macroclass ID;
uk_ua: ``MC ID`` : унікальний ідентифікатор макрокласу;

source: ``MC Info`` : Macroclass Information;
uk_ua: ``MC Info`` : характеристика макрокласу;

source: ``Class ID`` : Class ID;
uk_ua: ``Class ID`` : унікальний ідентифікатор класу;

source: ``C Info`` : Class Information;
uk_ua: ``C Info`` : характеристика класу;

source: ``Color`` : color field; double click to select a color for the plot;
uk_ua: ``Color`` : колір; двічі клацніть для вибору кольору графіка;

source: ``Plot`` :math:`\sigma` : if checked, plot the standard deviation for each signature;
uk_ua: ``Plot`` :math:`\sigma` : якщо опцію увімкнено, то для кожної сигнатури на графіку відображається стандартне відхилення;

source: [ ``Remove signatures`` ]: remove highlighted signatures from the list;
uk_ua: [ ``Remove signatures`` ]: вулучити вибрані сигнатури з переліку;

source: [ ``Fit to data`` ]: resize the plot to fit to all the data.
uk_ua: [ ``Fit to data`` ]: допасувати огляд графіку відповідно до значень даних.

source: Plot commands (from Matplotlib):
uk_ua: Управління графіком (з Matplotlib):

source: |m_home|: Reset to original view;
uk_ua: |m_home|: повернутись до початкового огляду;

source: |m_back|: Back to previous view;
uk_ua: |m_back|: повернутись до попереднього огляду;

source: |m_forward|: Forward to next view;
uk_ua: |m_forward|: перейти до наступного огляду;

source: |m_pan|: Pan axes with left mouse, zoom with right;
uk_ua: |m_pan|: вибір ділянки вісей для відображення лівою кнопкою миші, зміна масштабу - правою;

source: |m_zoom|: Zoom to rectangle;
uk_ua: |m_zoom|: збільшити до прямокутника;

source: |m_sub|: Unused;
uk_ua: |m_sub|: невикористовувана команда;

source: |m_save|: Save plot to a figure (e.g. JPG file);
uk_ua: |m_save|: зберегти графік до рисунку (файл JPG);

source: |m_edit|: Unused.
uk_ua: |m_edit|: невикористовувана команда.

source: **Tip**: it is possible to move the legend with the mouse.
uk_ua: **Порада**: легенду можна посунути мишкою.
